# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.25 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, USConv, [64, 6, 2, [False, True], 2]], # 0-P1/2
    [-1, 1, USConv, [128, 3, 2]], # 1-P2/4
    [-1, 3, USC3, [128]],
    [-1, 1, USConv, [256, 3, 2]], # 3-P3/8
    [-1, 6, USC3, [256]],
    [-1, 1, USConv, [512, 3, 2]], # 5-P4/16
    [-1, 9, USC3, [512]],
    [-1, 1, USConv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, USC3, [1024, [True, False]]],
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, USConv, [512, 1, 1, [False, True]]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Interleave, [1]], # cat backbone P4
    [-1, 3, USC3, [512, [True, True], False, True]], # 13

    [-1, 1, USConv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Interleave, [1]], # cat backbone P3
    [-1, 3, USC3, [256, [True, True], False, True]], # 17 (P3/8-small)

    [-1, 1, USConv, [256, 3, 2]],
    [[-1, 14], 1, Interleave, [1]], # cat head P4
    [-1, 3, USC3, [512, [True, True], False, True]], # 20 (P4/16-medium)

    [-1, 1, USConv, [512, 3, 2]],
    [[-1, 10], 1, Interleave, [1]], # cat head P5
    [-1, 3, USC3, [1024, [True, True], False, True]], # 23 (P5/32-large)

    [[17, 20, 23], 1, USDetect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
